{
  "proyectos": [
      {
          "nombre": "Controlador",
          "tipo": "privado",
          "descripcion": "Gestión centralizada de llaves electrónicas y control de acceso.",
          "detalles": [
              "Asignación y revocación de permisos de acceso en tiempo real.",
              "Gestión remota de dispositivos electrónicos de acceso.",
              "Registro y auditoría de accesos con historial detallado.",
              "Interfaz intuitiva con control en tiempo real."
          ],
          "tecnologias": "C#, WPF, SOAP, RESTful API, Multithreading, XML, Logging"
      },
      {
        "nombre": "Gestión de Áreas",
        "tipo": "privado",
        "descripcion": "Librería DLL en WPF para la gestión visual de estructuras jerárquicas en instalaciones.",
        "detalles": [
          "Representación jerárquica de áreas con expanders en WPF.",
          "Indicadores visuales de estado y alarmas en cada área.",
          "Interfaz de usuario intuitiva con controles modernos de WPF."
        ],
        "tecnologias": "C#, .NET, WPF, Expander, TreeView"
      },
      {
          "nombre": "Controlador",
          "tipo": "privado",
          "descripcion": "Integración de videovigilancia y monitoreo de alarmas en tiempo real.",
          "detalles": [
              "Conexión asíncrona con API del videograbador para supervisión de eventos.",
              "Captura y sincronización de datos multimedia en AppVision.",
              "Implementación de heartbeat y reconexión automática.",
              "Gestión multihilo para monitoreo escalable de videograbadores."
          ],
          "tecnologias": "C#, .NET Framework, API REST, OAuth, Multithreading, JSON"
      },
      {
        "nombre": "Gestión de Instalaciones",
        "tipo": "privado",
        "descripcion": "Librería DLL en WPF para visualizar y gestionar instalaciones con un sistema de tarjetas interactivas.",
        "detalles": [
          "Visualización en formato de tarjetas con detalles clave.",
          "Filtro y búsqueda de entidades según criterios avanzados.",
          "Acceso rápido a información detallada de cada entidad."
        ],
        "tecnologias": "C#, .NET, WPF, Custom UI, Data Filtering"
      },
      {
          "nombre": "Controlador",
          "tipo": "privado",
          "descripcion": "Solución para la gestión y monitoreo de eventos de comunicaciones en tiempo real.",
          "detalles": [
              "Monitoreo en tiempo real de eventos y llamadas usando WebSockets.",
              "Procesamiento y registro de parámetros críticos en AppVision.",
              "Gestión de variables y sincronización de eventos en la plataforma de gestión.",
              "Reconexión automática y manejo de errores en caso de fallos de conexión."
          ],
          "tecnologias": "C#, .NET Framework, WebSockets, JSON, Multithreading, AppVision"
      },
      {
          "nombre": "Controlador",
          "tipo": "privado",
          "descripcion": "Sistema de autenticación y control de accesos basado en ubicación para dispositivos.",
          "detalles": [
              "Autenticación basada en identificación personal (DNI).",
              "Verificación de proximidad geográfica para control de acceso.",
              "Monitoreo y control en tiempo real con procesamiento de eventos TCP.",
              "Implementación del algoritmo de Haversine para validación de distancia."
          ],
          "tecnologias": "C#, .NET Framework, TCP, HTTP, JSON, Haversine Algorithm"
      },
      {
        "nombre": "Gestión de Grupos",
        "tipo": "privado",
        "descripcion": "Librería DLL en WPF para administrar grupos con jerarquía y parámetros específicos.",
        "detalles": [
          "Organización de grupos y subgrupos en niveles jerárquicos.",
          "Filtros avanzados y búsqueda por parámetros específicos.",
          "Gestión de estados y alarmas en cada grupo."
        ],
        "tecnologias": "C#, .NET, WPF, AppVision API, Data Synchronization"
      },
      {
        "nombre": "Controlador",
        "tipo": "privado",
        "descripcion": "Solución de conectividad y monitoreo en tiempo real para sistemas de seguridad.",
        "detalles": [
            "Conexión persistente y monitoreo en tiempo real de dispositivos de seguridad.",
            "Sincronización de variables y control de zonas de sensores.",
            "Configuración y mantenimiento remoto de dispositivos.",
            "Registro de eventos y notificaciones en AppVision."
        ],
        "tecnologias": "C#, .NET Framework, TCP, AppVision SDK, Multithreading, Regex"
      },
      {
        "nombre": "Free Entertainment Project",
        "tipo": "publico",
        "descripcion": "Aplicación de entretenimiento gratuito que reúne películas de dominio público, TV, radio y resúmenes de fútbol.",
        "detalles": [
          "Agrega contenido de entretenimiento de fuentes públicas en un solo lugar.",
          "Interfaz de usuario moderna y funcional con diseño en Figma.",
          "Uso de Firebase para gestión de datos en la nube.",
          "Reproducción de contenido en streaming mediante ExoPlayer.",
          "Arquitectura basada en MVVM y Clean Architecture.",
          "Soporte para listas de reproducción en formato `.m3u8`.",
          "Sistema de favoritos y personalización del contenido."
        ],
        "tecnologias": "Kotlin, Android Studio, ExoPlayer, Firebase, MVVM, Clean Architecture, HLS Streaming",
        "link": "github_fep"
      },
      {
        "nombre": "Blog API",
        "tipo": "publico",
        "descripcion": "API REST para la gestión de un blog privado con autenticación JWT, control de acceso y almacenamiento en MongoDB.",
        "detalles": [
            "Autenticación y autorización con JWT para acceso seguro.",
            "Registro de usuarios limitado a una lista específica de colaboradores.",
            "Creación, actualización y eliminación de posts con asignación automática del autor.",
            "Gestión de comentarios en los posts, vinculados a usuarios autenticados.",
            "Configuración de CORS para permitir acceso desde clientes externos.",
            "Registro de eventos y errores con ILogger para monitoreo y depuración."
        ],
        "tecnologias": "C#, .NET 6, ASP.NET Core, MongoDB, JWT, Swagger, CORS",
        "link": "github_blogApi"
      },
      {
        "nombre": "Plataforma de Gestión de Contenidos",
        "tipo": "publico",
        "descripcion": "Sistema de administración y publicación de artículos, gestión de usuarios y control de contenido.",
        "detalles": [
            "Autenticación y autorización con JWT, protegiendo rutas sensibles.",
            "Gestión de usuarios con inicio de sesión, registro y control de sesiones.",
            "Creación, edición y eliminación de artículos con asignación automática del autor.",
            "Almacenamiento y recuperación de imágenes de perfil y artículos.",
            "Panel de administración con interfaz interactiva basada en Bootstrap.",
            "Validación de formularios y carga dinámica de contenido sin recargar la página.",
            "Control de acceso restringido a los artículos según el usuario autenticado.",
            "Manejo de errores y notificaciones mediante modales interactivos."
        ],
        "tecnologias": "MongoDB, JWT, HTML, CSS, JavaScript, Bootstrap, Fetch API",
        "link": "github_techBlog"
      },
      {
        "nombre": "Mi Portafolio Personal",
        "tipo": "publico",
        "descripcion": "Sitio web profesional para mostrar mis proyectos, experiencia y contacto.",
        "detalles": [
          "Desarrollado con HTML, CSS y JavaScript.",
          "Usa Tailwind CSS para un diseño moderno y responsivo.",
          "Cargado dinámicamente desde archivos JSON para mejor mantenimiento.",
          "Implementa modales interactivos para mostrar detalles de proyectos.",
          "Soporte para proyectos públicos y privados con una UX optimizada."
        ],
        "tecnologias": "HTML, CSS, JavaScript, Tailwind CSS, JSON",
        "link": "github_portafolio"
      }
  ]
}